[
  {
    "tag": "homepage",
    "title": "Willkommen zum XAI Method Finder!",
    "description": "Resultierend aus der öffentlichen Forderung nach fairer und für Menschen verständlicher KI, wurde in der Wissenschaft eine Vielzahl an Werkzeugen zur Erklärbarkeit entwickelt. <b>Die Auswahl eines passenden Erklärungswerkzeugs ist ein komplexes Vorhaben, das Expertenwissen benötigt.</b></br></br> In diesem Teil des XAI Tools möchten wir Dir <b>helfen, Erklärungsmethoden zu finden, die für Deinen Anwendungsfall geeignet sind.</b> Falls Du neu in dem Gebiet der erklärbaren künstlichen Intelligenz bist, empfehlen wir Dir zunächst unser <b><u>XAI Tutorial als Einstieg.</u></b>",
    "elements": [
      { "type": "image", "id": "robo_logo", "target": "/img/robot-intro.svg" }
    ]
  },
  {
    "tag": "startingTips",
    "title": "Hinweise zum Start",
    "description": "Im Verlauf des Method Finder werden dir verschiedene Fragen zu Deiner Anwendung, aber auch generelle Fragen zu Deinem Hintergrund und dem Kontext der Anwendung abgefragt. Basierend auf den Antworten empfehlen wir dir Werkzeuge, die nach aktuellem Stand der Wissenschaft für deinen Fall sinnvoll sein könnten.</br></br> <b>Beachte:</b> Wir schlagen Dir keine konkreten Erklärbarkeitsmethoden vor, sondern erstellen eine <b>Auswahl an Methoden und Design Empfehlungen</b> für Deinen Anwendungsfall, die perfekt für die Bedürfnisse Deiner Zielgruppe ist.",
    "elements": [
      { "type": "image", "id": "bulb_icon", "target": "/img/bulb_icon.svg" }
    ]
  },
  {
    "tag": "role",
    "title": "Zielgruppe - Rolle",
    "description": "Aus der relevanten Zielgruppe und ihren Aufgaben im Umgang mit der KI-Anwendung eröffnen sich unterschiedliche Möglichkeiten, aber auch Notwendigkeiten für die Erklärung. Ein Einfühlen in die Zielgruppe ist entscheidend für eine gute Erklärung. <br><b>BEACHTE:</b> Die Zielgruppe einer Erklärung muss nicht gleichbedeutend sein mit der Zielgruppe der KI-Anwendung.",
    "elements": [
      {
        "type": "select",
        "choice_question": "Wähle aus welche Rolle deine Zielgruppe(n) ausüben:",
        "options": [
          {
            "title": "Betroffen",
            "tag": "stakeholder",
            "index": 0,
            "description": "Die Zielgruppe ist von der Entscheidung der KI-Anwendung betroffen."
          },
          {
            "title": "Benutzer",
            "tag": "user",
            "index": 1,
            "description": "Die Zielgruppe ist Benutzer der KI-Anwendung."
          },
          {
            "title": "Entwickler",
            "tag": "developer",
            "index": 2,
            "description": "Die Zielgruppe ist Entwickler der KI-Anwendung."
          },
          {
            "title": "Eigentümer",
            "tag": "owner",
            "index": 3,
            "description": "Die Zielgruppe ist Eigentümer der KI-Anwendung."
          },
          {
            "title": "Validator",
            "tag": "validator",
            "index": 4,
            "description": "Die Zielgruppe ist Validator der KI-Anwendung."
          },
          {
            "title": "Unbekannt/Anderes",
            "tag": "unknown",
            "index": 5,
            "description": ""
          }
        ]
      }
    ]
  },
  {
    "tag": "expertise",
    "title": "Zielgruppe - Fachwissen",
    "description": "Das Wissensniveau der Zielgruppe ist entscheidend für die Komplexität der Erklärung. <br><b>Beispiel:</b> Wenn eine KI-Anwendung erklärt werden soll, die Werkzeuge am Griff erkennt, kann die Erklärung für einen Handwerker komplexer sein als für ein Grundschulkind.",
    "elements": [
      {
        "type": "slider",
        "choice_question": "Wähle das Niveau an Fachwissen von deiner Zielgruppe(n) aus:",
        "options": []
      }
    ]
  },
  {
    "tag": "goal",
    "title": "Zielgruppe - Erklärziel",
    "description": "Nach dem Bestimmen der Rolle und des Fachwissens der Zielgruppe ist es wichtig die Zielsetzung der Erklärung zu identifizieren. Das heißt welches Ziel soll die Erklärung für die spezifische Zielgruppe erfüllen. In der Literatur wird zwischen sechs Zielkategorien differenziert. <br><b>Hinweis:</b> Mehr Details zu den Erklärungsziele findest du, wenn du mit der Maus über die Zielkategorien gehst.",
    "elements": [
      {
        "type": "select",
        "choice_question": "Wähle aus welche Erklärungsziele für deine Zielgruppe(n) wichtig sind:",
        "options": [
          {
            "title": "Vertrauen",
            "tag": "trust",
            "index": 0,
            "description": "Die Erklärung soll das Vertrauen der Zielgruppe in die KI-Anwendung erhöhen."
          },
          {
            "title": "Legitimieren",
            "tag": "legitimate",
            "index": 1,
            "description": "Die Erklärung soll die Entscheidung der KI-Anwendung legitimieren."
          },
          {
            "title": "Evaluieren",
            "tag": "evaluate",
            "index": 2,
            "description": "Die Erklärung soll die Qualität der KI-Anwendung evaluieren."
          },
          {
            "title": "Verbessern",
            "tag": "improve",
            "index": 3,
            "description": "Die Erklärung soll die KI-Anwendung verbessern."
          },
          {
            "title": "Lernen",
            "tag": "learn",
            "index": 4,
            "description": "Die Erklärung soll die Zielgruppe etwas über die KI-Anwendung lernen lassen."
          },
          {
            "title": "Unbekannt/Anderes",
            "tag": "unknown",
            "index": 5,
            "description": ""
          }
        ]
      }
    ]
  },
  {
    "tag": "dataType",
    "title": "Datentyp",
    "description": "Neben der Zielgruppe ist auch die Art der Daten, die von der KI-Anwendung genutzt werden, von Bedeutung. Je nach Datentyp können unterschiedliche Erklärbarkeitswerkzeuge von Nutzen sein.",
    "elements": [
      {
        "type": "select",
        "choice_question": "Wähle den Datentyp der KI-Anwendung aus:",
        "options": [
          {
            "title": "Bilder",
            "tag": "images",
            "index": 0,
            "description": "Die KI-Anwendung verarbeitet Bilder."
          },
          {
            "title": "Text",
            "tag": "text",
            "index": 1,
            "description": "Die KI-Anwendung verarbeitet Text."
          },
          {
            "title": "Tabellarische Daten",
            "tag": "tabular",
            "index": 2,
            "description": "Die KI-Anwendung verarbeitet tabellarische Daten."
          },
          {
            "title": "Unbekannt/Anderes",
            "tag": "unknown",
            "index": 3,
            "description": "<b>Sie nutzen einen anderen Datentyp oder wissen nicht genau welchen Datentyp sie verwenden? Kein Problem! Bitte erklären Sie uns in Ihren Worten was Sie für Daten nutzen und wir finden die geeignete Methode für Sie!</b>"
          }
        ]
      }
    ]
  },
  {
    "tag": "problemType",
    "title": "Problemtyp",
    "description": "Ein zentraler Aspekt ist die zugrunde liegende, mathematische Problemstellung die eine KI-Anwendung löst. Oftmals lassen sich aber diese auf drei Hauptprobleme, die man mit maschinellem Lernen lösen kann zusammenfassen. XAI Methoden sind häufig auf einzelne Probleme spezialsiert und können nicht für jedes der drei Hauptprobleme genutzt werden.",
    "elements": [
      {
        "type": "select",
        "choice_question": "Wähle den Anwendungstyp der KI-Anwendung aus:",
        "options": [
          {
            "title": "Regression",
            "tag": "regression",
            "index": 0,
            "description": "Es wird verwendet, um die Auswirkung einer unabhängigen Variablen auf eine andere Variable zu bestimmen und wenn die abhängige Variable ein kontinuierlicher Wert ist."
          },
          {
            "title": "Klassifikation",
            "tag": "classification",
            "index": 1,
            "description": "Ordnet einen Eintrag bestimmten Kategorien oder Klassen zu. Es geht um die Klassifizierung von Eingabedaten in vorgegebene Klassen."
          },
          {
            "title": "Generierung",
            "tag": "generative",
            "index": 2,
            "description": "Es wird verwendet, um neue Datenmuster zu erzeugen. Durch die Modellierung der Datenverteilung können Datenmuster erzeugt werden, die dem ursprünglichen Datensatz ähnlich sind, sich aber von ihm unterscheiden."
          },
          {
            "title": "Unbekannt/Anderes",
            "tag": "unknown",
            "index": 3,
            "description": "<b>Ihre KI Anwendung löst eine andere Aufgabe oder Sie wissen nicht genau welche Aufgabe Ihr KI Anwendung löst? Kein Problem! Bitte erklären Sie uns in Ihren Worten was genau Ihr KI Anwendung macht und wir finden eine geeignete Methode für Sie!</b>"
          }
        ]
      }
    ]
  },
  {
    "tag": "modelType",
    "title": "Modelltyp",
    "description": "Zur Lösung einer bestimmten, mathematischen Problemstellung können unterschiedliche Typen von Modellen des maschinellen Lernens zum Einsatz kommen. Welches Modell man für die Anwendung benutzt ist ausschlaggebend für die Auswahl der XAI Methode, da diese oftmals nur für bestimmte Modelltypen entwickelt wurden.",
    "elements": [
      {
        "type": "select",
        "choice_question": "Wähle den Modelltyp der KI-Anwendung aus:",
        "options": [
          {
            "title": "CNN",
            "tag": "cnn",
            "index": 0,
            "description": "Es handelt sich um eine Art künstliches neuronales Netz, das zur Verarbeitung visueller Daten verwendet wird. Es funktioniert, indem es kleine Teile von Bildern analysiert und diese Teile zu einem größeren Bild kombiniert."
          },
          {
            "title": "Multilayer Perceptron",
            "tag": "mlp",
            "index": 1,
            "description": "Es handelt sich um eine Art künstliches neuronales Netz, das zur Verarbeitung von Textdaten verwendet wird. Es arbeitet, indem es den Kontext des Textes versteht und diesen Kontext nutzt, um den Text aussagekräftiger zu machen."
          },
          {
            "title": "Large Language Model",
            "tag": "llm",
            "index": 2,
            "description": "Es handelt sich um ein fortschrittliches künstliches neuronales Netz, das auf das Verstehen und Erzeugen natürlicher Sprache spezialisiert ist. Es ist in der Lage, komplexe sprachliche Muster zu erkennen, den Kontext zu verstehen und menschenähnlichen Text zu erzeugen."
          },
          {
            "title": "Unbekannt/Anderes",
            "tag": "unknown",
            "index": 3,
            "description": "<b>Sue nutzen einen anderen Modelltyp oder Sie sind sich nicht ganz sicher welchen Modelltyp Sie nutzen? Kein Problem! Bitte beschreiben Sie uns in Ihren eigenen Worten welchen KI Algorithmus sie verwenden und wir finden die passende Methode für Sie</b>"
          }
        ]
      }
    ]
  },
  {
    "tag": "transitionPage1",
    "title": "Was soll erklärt werden?",
    "description": "Welche Erklärungsmethode zu dir passt hängt davon <b>welche Fragen im Umgang mit der KI die Erklärung beantworten soll. Wie ein Arzt der seine Patienten befragt um über ihren Gesundheitszustand zu erfahren kann man die KI-Anwendung befragen um über den “Zustand”, also die Güte des KI-Ergebnis, zu lernen.</b> Das kann zum Beispiel sein “Wieso habe ich dieses Ergebnis bekommen?”. Oder es könnte auch sein “Ab wann hätte ich ein anderes Ergebnis bekommen?”. In der Literatur werden <b>drei Kategorien</b> von Fragen unterschieden. Im folgenden kannst du nun auswählen, welche Frage(n) für dich von Interesse sind.",
    "elements": [
      {
        "type": "image",
        "id": "talking_people",
        "target": "/img/talking_people.svg"
      }
    ]
  },
  {
    "tag": "question1",
    "title": "Fragentyp 1: Wie funktioniert die KI-Anwendung im Allgemeinen?",
    "description": "Allgemeine Erklärungen von KI-Anwendungen, auch <b>globale Erklärungen</b> genannt, geben Einblick welche allgemeinen Konzepte der Algorithmus lernt um Vorhersagen zu treffen. Unter Konzepten versteht man Ideen, Muster und Merkmale.",
    "elements": [
      {
        "type": "image",
        "id": "question_types",
        "target": "/img/question_types1.svg"
      },
      {
        "type": "question",
        "explanation_scope": "global"
      }
    ]
  },
  {
    "tag": "question2",
    "title": "Fragentyp 2: Wie funktioniert die KI-Anwendung im konkreten Fall?",
    "description": "Erklärungen für spezifische Anwendungsfälle, auch <b>lokale Erklärungen</b> genannt, erklären die Vorhersage des KI-Algorithmus in einzelnen Fällen.",
    "elements": [
      {
        "type": "image",
        "id": "question_types",
        "target": "/img/question_types2.svg"
      },
      {
        "type": "question",
        "explanation_scope": "local"
      }
    ]
  },
  {
    "tag": "question3",
    "title": "Fragentyp 3: Ab wann ändert sich die Vorhersage?",
    "description": "Eine mögliche Vorgehensweise zum Verstehen der KI-Anwendung ist das Betrachten von Grenzfällen. Das heißt was man verändern muss, damit die aktuelle Vorhersage eine andere wird. Diese Vorgehensweise wird <b>kontrafaktische Erklärung</b> genannt.",
    "elements": [
      {
        "type": "image",
        "id": "question_types",
        "target": "/img/question_types3.svg"
      },
      {
        "type": "question",
        "explanation_scope": "counterfactual"
      }
    ]
  },
  {
    "tag": "xaiMethods",
    "title": "Deine persönliche XAI Lösung",
    "description": "Je nach den technischen Merkmalen Ihres KI-Modells empfehlen wir Ihnen, eine dieser Methoden zu verwenden:",
    "elements": []
  },
  {
    "tag": "targetSpecific",
    "title": "Deine persönliche XAI Lösung",
    "description": "Um sicherzustellen, dass die Erklärung für Ihre Zielgruppe leicht verständlich ist, sollten diese Gestaltungsprinzipien berücksichtigt werden:",
    "elements": [
      {
        "target_group": [
          { "tag": "user" },
          { "tag": "stakeholder"},
          { "tag": "owner"},
          { "tag": "validator"}
        ],
        "definition": [
          {
            "expertise": 0,
            "explanations": [
              {"title": "Erklärungsart",
               "tag": "declaration_type",
               "text": "Für die ausgewählte Zielgruppe ohne spezifisches Fachwissen empfehlen wir die Folgende Erklärungsfromen: Visualisierung, Textualisierung, Dialog. Eine kombinierte Darstellung von textbasierter Erklärung mit einfacher Sprache und klarer Visualisierung ist auch eine Möglichkeit."
              },
              {"title": "Interaktivität",
               "tag": "interactivity",
               "text": "Für Ihre Zielgruppe ist Interaktivität sehr wichtig für Verständnis. Die Möglichkeit selbst das Vorgehen des Modelles zu erkunden ist zu empfehlen."
              },
              {"title": "Komplexität",
               "tag": "complexity",
               "text": "Die Erklärung sollte sich auf einem Verständnis und Interpretations Level befinden wofür man keine zusätzlichen Informationen benötigt. Die Komplexität sollte so gering wie möglich gehalten werden. Die Erklärung sollte zusätzlich mittles einfacher Sprache erklärt werden."
              },
              {"title": "Personalisierbarkeit",
               "tag": "personalisability",
               "text": "Oberflächliche Personalisierungsmöglichkeiten (Farbe und größe von Abbildungen, Schriftart) sind zu empfehlen. Von Personalisierbarkeit der technischen Komponenten der XAI-Methode sollte abgesehen werden, da Gefahr der Überforderung besteht."
              }
            ] 
          },
          {
            "expertise": 1,
            "explanations": [
              {"title": "Erklärungsart",
               "tag": "declaration_type",
               "text": "Für die ausgewählte Zielgruppe ohne spezifisches Fachwissen empfehlen wir die Folgende Erklärungsfromen: Visualisierung, Textualisierung, Dialog. Eine kombinierte Darstellung von textbasierter Erklärung mit einfacher Sprache und klarer Visualisierung ist auch eine Möglichkeit."
              },
              {"title": "Interaktivität",
               "tag": "interactivity",
               "text": "Für Ihre Zielgruppe ist Interaktivität sehr wichtig für Verständnis. Die Möglichkeit selbst das Vorgehen des Modelles zu erkunden ist zu empfehlen."
              },
              {"title": "Komplexität",
               "tag": "complexity",
               "text": "Da die Zielgruppe der Erklärung fachspezifisches Wissen hat kann die Erklärung auf dem Level sein welches diesem fachspezifischen Wissen entspricht. Die Komplexität sollte dennoch so gering wie möglich gehalten werden."
              },
              {"title": "Personalisierbarkeit",
               "tag": "personalisability",
               "text": "Oberflächliche Personalisierungsmöglichkeiten (Farbe und größe von Abbildungen, Schriftart) sind zu empfehlen. Von Personalisierbarkeit der technischen Komponenten der XAI-Methode sollte abgesehen werden, da Gefahr der Überforderung besteht."
              }
            ] 
          }
        ]
      },
      {
        "target_group": [
          { "tag": "developer" }
        ],
        "definition": [
          {
            "expertise": 0,
            "explanations": [
              {"title": "Erklärungsart",
               "tag": "declaration_type",
               "text": "Für Ihre Zielgruppe empfehlen wir die Erklärungsfrom statistische Zusammenfasssung, Visualisierung. Studien zeigen, dass Entwicklende dadurch ein tieferes Verständnis für das Modell entwickeln können als mit vergleichsweise textbasierter Erklärung."
              },
              {"title": "Interaktivität",
               "tag": "interactivity",
               "text": "Für diese Zielgruppe sind sowohl statische als auch interaktive Erklärungen möglich."
              },
              {"title": "Komplexität",
               "tag": "complexity",
               "text": "Die Erklärung kann ein erhöhten Anspruch an technischen Anforderungen haben. Aber es sollte darauf geachtet weren das fachspezifiches Wissen auf leichterem abstraktions Level dargeboten wird."
              },
              {"title": "Personalisierbarkeit",
               "tag": "personalisability",
               "text": "Für diese Zielgruppe können auch Personalisierungen die technischen Feinheiten der XAI-Methode betreffend in die Erklärung eingebaut werden."
              }
            ]
          },
          {
            "expertise": 1,
            "explanations": [
              {"title": "Erklärungsart",
               "tag": "declaration_type",
               "text": "Für Ihre Zielgruppe empfehlen wir die Erklärungsfrom statistische Zusammenfasssung, Visualisierung. Studien zeigen, dass Entwicklende dadurch ein tieferes Verständnis für das Modell entwickeln können als mit vergleichsweise textbasierter Erklärung."
              },
              {"title": "Interaktivität",
               "tag": "interactivity",
               "text": "Für diese Zielgruppe sind sowohl statische als auch interaktive Erklärungen möglich. Interaktion ist aber nicht zwingend notwendig."
              },
              {"title": "Komplexität",
               "tag": "complexity",
               "text": "Die Erklärung kann ein hohes und anspruchsvolles Komplexitätslevel haben."
              },
              {"title": "Personalisierbarkeit",
               "tag": "personalisability",
               "text": "Für diese Zielgruppe können auch Personalisierungen die technischen Feinheiten der XAI-Methode betreffend in die Erklärung eingebaut werden."
              }
            ]
          }
        ]
      }
    ]
  }
]